cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
/*
   Copyright (c) 2024. CRIDP https://github.com/cridp

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

           http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
 */

#include <esp32-hal-gpio.h>
#include <map>
#include "esp_log.h"

#include <iohcRadio.h>
#include <log_buffer.h>
#include <utility>

// #include "FHSSCalibration.hpp"
#include "iohcCozyDevice2W.h"

// trame typique FSK : preamble (variable) + sync (3 B) + header (2 B) + payload (32 B) + CRC (2 B).
// airtime (s) = ( (preamble_bytes + 3 + 2 + payload_bytes + 2) * 8 ) / bitrate
#define LONG_PREAMBLE_MS 128  // 0x80 52-206 ms
#define SHORT_PREAMBLE_MS 16 // 11.458 ms
// Timeouts adaptatifs basés sur le débit
// airtime (s) = ( (preamble_bytes + 3SYNC + 2HEAD + payload_bytes + 2CRC) * 8 ) / bitrate
const uint32_t bitrate = 38400; // 38.4 kbps
const uint32_t maxPacketBits = (SHORT_PREAMBLE_MS + 3 + 2 + MAX_FRAME_LEN + 2) * 8;
const uint32_t minAirTimeMs = (maxPacketBits * 1000) / bitrate; // ~ms

TaskHandle_t IOHC::iohcRadio::txTaskHandle = nullptr;

// Structure pour gérer un paquet en transmission
struct TxPacketWrapper {
    IOHC::iohcPacket *packet;
    uint8_t repeatsRemaining;
    uint32_t repeatTime;

    explicit TxPacketWrapper(IOHC::iohcPacket *pkt)
        : packet(pkt),
          repeatsRemaining(pkt ? pkt->repeat : 0),
          repeatTime(pkt ? pkt->repeatTime : 0)
          {}

    ~TxPacketWrapper() {
        if (packet) {
            delete packet;
            packet = nullptr;
        }
    }
};

namespace IOHC {
    iohcRadio *iohcRadio::_iohcRadio = nullptr;
    // volatile bool iohcRadio::_g_preamble = false;
    // volatile bool iohcRadio::_g_payload = false;
    volatile uint32_t iohcRadio::_g_payload_millis = 0L;
    uint8_t iohcRadio::_flags[2] = {0, 0};
    volatile bool iohcRadio::f_lock_hop = false;
    volatile bool iohcRadio::send_lock = false;
    volatile bool iohcRadio::txMode = false;
    volatile iohcRadio::RadioState iohcRadio::radioState = iohcRadio::RadioState::IDLE;

    static IOHC::iohcPacket last1wPacket;

    TaskHandle_t handle_interrupt;
    //
    struct RadioIrqEvent {
        uint8_t flags;         // bit0 = preamble, bit1 = payload, autres reserved
        uint32_t ts_ms;        // timestamp en ms (esp_timer_get_time()/1000)
    };

    static QueueHandle_t radioIrqQueue = nullptr;
    static constexpr size_t RADIO_IRQ_QUEUE_LEN = 128;

    /**
    * No semaphore / lockFHSS() / updateFHSSActivity() here.
    * esp_timer_get_time() is ISR-safe ; millis() never sure.
    */
    void IRAM_ATTR handle_interrupt_fromisr() {
        // Debounce
        static uint32_t lastIsrTime = 0;
        uint32_t now = esp_timer_get_time();
        if (now - lastIsrTime < 100) return; // 100µs debounce
        lastIsrTime = now;

        // Only GPIOS (opérations très courtes), pas d'appels bloquants
        bool preamble = digitalRead(RADIO_PREAMBLE_DETECTED);
        bool payload  = digitalRead(RADIO_PACKET_AVAIL);

        // Create an event
        RadioIrqEvent ev;
        ev.flags = 0;
        if (preamble) ev.flags |= 0x01;
        if (payload)  ev.flags |= 0x02;
        ev.ts_ms = static_cast<uint32_t>(now / 1000ULL);

        // Send it to queue (FromISR)
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        if (radioIrqQueue) {
            // Ignored if queue empty
            if (xQueueSendFromISR(radioIrqQueue, &ev, &xHigherPriorityTaskWoken) != pdTRUE) {
                // Optionnel Compteur de drops (volatile)
                // irq_drop_count++;
            }
        }
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }

    /**
    * Sequential : Read queue — no concurrencies possible.
    * tickerCounter isn't called by the ISR.
    */
    void handle_interrupt_task(void *pvParameters) {
        IOHC::iohcRadio *radio = static_cast<IOHC::iohcRadio*>(pvParameters);
        RadioIrqEvent ev;
        const TickType_t xMaxBlock = pdMS_TO_TICKS(500); // ou portMAX_DELAY si on veux

        while (true) {
            if (xQueueReceive(radioIrqQueue, &ev, xMaxBlock) == pdTRUE) {
                // No reentrance possible, using sequential
                bool preamble = ev.flags & 0x01;
                bool payload  = ev.flags & 0x02;

                if (preamble) {
                    // timestamp and lock
                    radio->lockFHSS(iohcRadio::FHSSLockReason::PREAMBLE_DETECTED);
                    radio->updateFHSSActivity(); // Write atomic safe
                    radio->setRadioState(iohcRadio::RadioState::PREAMBLE);
                }
                if (payload) {
                    // timestamp - Reception and lock
                    radio->lockFHSS(iohcRadio::FHSSLockReason::RECEIVING);
                    radio->updateFHSSActivity();
                    radio->setRadioState(iohcRadio::RadioState::PAYLOAD);
                    // Call tickerCounter (read SPI, receive(), etc.)
                    // tickerCounter is in task — can use semaphores, malloc, etc. Not the ISR is able to do that
                    radio->tickerCounter(radio);
                }
            }
            // No busy-wait
        }
    }

    void FHSSTimer(iohcRadio *iohc_radio) {
        // Check timeout
        iohc_radio->checkFHSSTimeout();

        // Si toujours verrouillé, pas de hop
        if (iohc_radio->f_lock_hop) {
            return;
        }

        // Ne sauter que si on est vraiment en RX idle
        if (iohcRadio::radioState != iohcRadio::RadioState::RX) {
            return;
        }

        // Incrémenter l'index de fréquence
        iohc_radio->currentFreqIdx++;
        if (iohc_radio->currentFreqIdx >= iohc_radio->num_freqs) {
            iohc_radio->currentFreqIdx = 0;
        }

