cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // Changer la fréquence seulement si on est en RX
        Radio::setCarrier(Radio::Carrier::Frequency, iohc_radio->scan_freqs[iohc_radio->currentFreqIdx]);

        // ESP_LOGV("IOHC", "FHSS hop to freq[%d]: %d Hz",
        //  iohc_radio->currentFreqIdx,
        //  iohc_radio->scan_freqs[iohc_radio->currentFreqIdx]);
    }

    /**
    * Verrouille le FHSS avec une raison spécifique
    */
    void iohcRadio::lockFHSS(const FHSSLockReason reason) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            // Garder la raison la plus "forte"
            if (reason > fhssLockReason) {
                fhssLockReason = reason;
                f_lock_hop = true;
                lastActivityTime = esp_timer_get_time();

                // ets_printf("(D) FHSS locked: %s\n", fhssLockReasonToString(reason));
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
     * Déverrouille le FHSS pour une raison spécifique
     */
    void iohcRadio::unlockFHSS(const FHSSLockReason reason) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            // Déverrouiller seulement si c'est la même raison
            if (fhssLockReason == reason) {
                fhssLockReason = FHSSLockReason::NONE;
                f_lock_hop = false;

                // ets_printf("(D) FHSS unlocked: %s\n", fhssLockReasonToString(reason));
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
        * Force le déverrouillage (pour reset manuel)
        */
    void iohcRadio::forceUnlockFHSS() {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            fhssLockReason = FHSSLockReason::NONE;
            f_lock_hop = false;
            expectingResponse = false;

            // ESP_LOGW("IOHC", "FHSS force unlocked");
            xSemaphoreGive(fhss_state_mutex);
        }
    }
    void iohcRadio::setFHSSState(FHSSState newState) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            FHSSState oldState = fhssState;
            fhssState = newState;

            // Log des transitions d'état importantes
            if (oldState != newState) {
                // ets_printf("FHSS State transition: %s -> %s\n", fhssStateToString(oldState), fhssStateToString(newState));
            }

            // Actions spécifiques selon le nouvel état
            switch (newState) {
                case FHSSState::SCANNING:
                    f_lock_hop = false; // Autoriser le hopping
                    break;
                case FHSSState::PREAMBLE_DETECTED: //{calibration->onPreambleDetected();}
                case FHSSState::RECEIVING: //{calibration->onPayloadStart(false, this->currentFreqIdx);}
                case FHSSState::PROCESSING: //{calibration->onPayloadComplete(0.0, 0);}
                case FHSSState::TRANSMITTING:
                    f_lock_hop = true; // Bloquer le hopping
                    break;
            }

            xSemaphoreGive(fhss_state_mutex);
        }
    }
    iohcRadio::FHSSState iohcRadio::getFHSSState() {
        FHSSState state = FHSSState::SCANNING;
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            state = fhssState;
            xSemaphoreGive(fhss_state_mutex);
        }
        return state;
    }

    const char* iohcRadio::fhssStateToString(FHSSState state) {
        switch (state) {
            case FHSSState::SCANNING: return "SCANNING";
            case FHSSState::PREAMBLE_DETECTED: return "PREAMBLE_DETECTED";
            case FHSSState::RECEIVING: return "RECEIVING";
            case FHSSState::PROCESSING: return "PROCESSING";
            case FHSSState::TRANSMITTING: return "TRANSMITTING";
            default: return "UNKNOWN";
        }
    }
    /**
     * FHSS Watchdog
     */
    void iohcRadio::checkFHSSTimeout() {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {

            if (f_lock_hop && fhssLockReason != FHSSLockReason::TRANSMITTING) {
                uint64_t elapsed = esp_timer_get_time() - lastActivityTime;
                uint64_t timeout = 3 * minAirTimeMs; // 3x margin
                // uint32_t timeout = 48; // = expectingResponse ? responseTimeoutMs : FHSS_UNLOCK_TIMEOUT_MS ;
                if (fhssLockReason == FHSSLockReason::PREAMBLE_DETECTED) timeout = 256000;  // PreambleTimeout
                if (fhssLockReason == FHSSLockReason::RECEIVING) timeout = 15000;  // PayloadTimeout

                if (elapsed >= timeout) {
                    if (fhssLockReason != FHSSLockReason::PREAMBLE_DETECTED)
                        // ets_printf("(D) FHSS timeout(%lld), forcing unlock (reason: %s, elapsed: %lldµs)\n", timeout, fhssLockReasonToString(fhssLockReason), elapsed);
                    fhssLockReason = FHSSLockReason::NONE;
                    f_lock_hop = false;
                    expectingResponse = false;

                    // Remettre la radio en état RX
                    if (radioState != RadioState::TX) {
                        Radio::setRx();
                        setRadioState(RadioState::RX);
                        unlockFHSS(fhssLockReason);
                        adaptiveFHSS->update();
                    }
                }
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
     * Mettre à jour l'horodatage d'activité
     * Pas besoin de mutex pour juste mettre à jour un uint32_t
     */
    inline void IRAM_ATTR iohcRadio::updateFHSSActivity() {
        lastActivityTime = esp_timer_get_time();
    }
    /**
    * Indique qu'on attend une réponse après un envoi
    */
    void iohcRadio::setExpectingResponse(bool expecting, uint32_t timeoutMs = 1000) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            expectingResponse = expecting;
            responseTimeoutMs = timeoutMs;
            if (expecting) {
                lockFHSS(FHSSLockReason::WAITING_RESPONSE);
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }


    iohcRadio::iohcRadio() {
        Radio::initHardware();
        Radio::calibrate();

        Radio::initRegisters(MAX_FRAME_LEN);
        Radio::setCarrier(Radio::Carrier::Deviation, 19200);
        Radio::setCarrier(Radio::Carrier::Bitrate, 38400);
        Radio::setCarrier(Radio::Carrier::Bandwidth, 250);
        Radio::setCarrier(Radio::Carrier::Modulation, Radio::Modulation::FSK);

