cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // Lancer le timer pour ce paquet
        Ticker.attach_ms(repeatTime, packetSender, this);

        return true;
    }

    /**
     * Arrête la transmission
     */
    void iohcRadio::stopTransmission() {
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            isSending = false;
            Ticker.detach();

            // Nettoyer le paquet courant
            if (currentTxPacket) {
                delete currentTxPacket;
                currentTxPacket = nullptr;
            }
            // Marquer comme non-envoi
            isSending = false;

            // Déverrouiller la radio
            // if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                txMode = false;
                // f_lock_hop = false;
                unlockFHSS(FHSSLockReason::TRANSMITTING);
                // xSemaphoreGive(fhss_state_mutex);
            // }

            // Remettre en RX
            if (radioState != RadioState::RX) {
                // Radio::setRx();
                // setRadioState(RadioState::RX);
            }
            xSemaphoreGive(tx_mutex);
        }
    }

    /**
     * Vide la queue de transmission
     */
    void iohcRadio::clearTxQueue() {
        while (!txQueue.empty()) {
            const TxPacketWrapper *wrapper = txQueue.front();
            txQueue.pop_front();
            delete wrapper; // Le destructeur libère la mémoire
        }
    }

    /**
    * Vérifie si une transmission est en cours
    */
    bool iohcRadio::isTransmitting() const {
        bool transmitting = false;
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            transmitting = isSending;
            xSemaphoreGive(tx_mutex);
        }
        return transmitting;
    }

    /**
     * Annule toutes les transmissions en cours
     */
    void iohcRadio::cancelTransmissions() {
        Ticker.detach();
        clearTxQueue();
        stopTransmission();
    }
}
